In [1]:
import MySQLdb

In [2]:
from sqlalchemy import create_engine

In [3]:
db = MySQLdb.connect(
    "13.125.237.246",# ip
    "root",# user name
    "dss8",# pw
    "city_info",# database (option)
    charset = "utf8"
)

##### select

In [4]:
curs = db.cursor()

In [5]:
query = """
    SELECT *
    FROM popular
"""

In [6]:
count = curs.execute(query)
count

5

데이터 5개(row)

In [7]:
rows = curs.fetchall()
rows

((1, 'seoul', 9904312),
 (2, 'busan', 3448737),
 (3, 'incheon', 2890451),
 (4, 'daegu', 2466052),
 (5, 'daejeon', 1538394))

In [8]:
curs.fetchall()

()

fetchall을 하는순간 cursor안에 저장되어있던 데이터를 리턴하고 다 삭제함

그래서 두 번하면 null

##### insert - (update, delete : 쿼리문만 바꿔주면 되기때문에 insert로만 진행)

In [9]:
query = """
    INSERT INTO popular(rank, city_name, popular)
    VALUES(6, "gwangju", 1502881)
"""

In [10]:
# curs = db.cursor()
count = curs.execute(query)
count

1

여기까진 db에 반영 안됨. cursor에서 가지고 있음.

In [11]:
db.commit()

이걸 해야 db에 적용

In [12]:
db.close()

종료해줘야함

#### pandas
- database -> dataframe

In [13]:
db = MySQLdb.connect(
    "13.125.237.246",# ip
    "root",# user name
    "dss8",# pw
    "city_info",# database (option)
    charset = "utf8"
)

In [14]:
query = """
    SELECT *
    FROM popular
"""

In [15]:
city_df = pd.read_sql(query, db)
city_df

   rank city_name  popular
0     1     seoul  9904312
1     2     busan  3448737
2     3   incheon  2890451
3     4     daegu  2466052
4     5   daejeon  1538394
5     6   gwangju  1502881

#### pandas
- dataframe -> database
- table을 직접 정의해서 옮기는게 아님. data type을 고려해야함

In [16]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [18]:
engine = create_engine("mysql://root:dss8@13.125.237.246/test")

In [19]:
tips.to_sql("tips", con=engine, if_exists='replace')

dataframe -> database : sqlalchemy로만 할수 있음

db에서 data type을 만져줘야함!!